{
    "create": "Allows a user to appeal a ban from a server they are banned from.\nThe user must not be on the bot's global blacklist.\n\n**Permissions:**\n- None required for the user.",
    "report": "Reports a ban to the Banwatch staff for review.\nThis is for bans that may be unjust or harmful.\nThe user must not be on the bot's global blacklist.\n\n**Permissions:**\n- None required for the user.",
    "change": "Changes server-specific settings for Banwatch.\n\n**Permissions:**\n- `Manage Server`",
    "appeals": "Enables or disables the ban appeal system for this server.\n\n**Permissions:**\n- `Manage Server`",
    "visibility": "Toggles whether this server's bans are visible in public lookups.\n\n**Permissions:**\n- `Manage Server`",
    "permissioncheck": "Checks if the bot has the required permissions in the current channel and server. This is the first step in troubleshooting if the bot is not functioning as expected. Please run this command before contacting support.\n\n**Permissions:**\n- None required for the user.",
    "add": "Adds evidence to a user's ban record.\nCan be text, attachments, or both.\n\n**Permissions:**\n- `Moderate Members`",
    "get": "Retrieves and displays all evidence for a given user or ban ID.\n\n**Permissions:**\n- `Moderate Members`",
    "manage": "Displays evidence in a paginated view for management.\nAllows staff to review and handle evidence entries.\n\n**Permissions:**\n- `Moderate Members`",
    "lookup": "Looks up a user's ban history across all monitored servers.\nCan search by user or a specific ban ID.\n\n**Permissions:**\n- `Ban Members`",
    "checkall": "Scans all members in the current server against the global ban database.\nReports users who are found in the database.\n\n**Permissions:**\n- `Ban Members`",
    "remove_deleted": "Scans the server's ban list and removes entries for deleted user accounts, and kicks any deleted accounts still present in the server! This will help you clean up IP bans and ensure your server is free of inactive or deleted users.\n\nWhy would you want to remove IP bans for deleted users? In many cases the IP has been reassigned to a new person because most ISPs recycle IP addresses. Keeping bans for deleted users can inadvertently block new users who are assigned those IPs, potentially causing frustration and loss of legitimate members.\n\n**Permissions:**\n- `Manage Server`\n- `Premium Server`",
    "trapbutton": "Creates a message with a button that instantly bans any user who clicks it.\nUseful for catching malicious bots. Make sure to warn your members not to click it!\n\nThis feature is currently a test; if you have feedback on how to improve its efficacy, please reach out to the support server.\n\n**Permissions:**\n- `Manage Server`\n- `Premium Server`",
    "traprole": "[PREMIUM] Designates a 'trap role'. Any user assigned this role will be instantly banned. This is useful for catching bots that assign themselves roles through onboarding or other automated processes; simply assign the trap role to the bot and it will be banned when the task runs (every hour!).\n\nThis feature is currently a test; if you have feedback on how to improve its efficacy, please reach out to the support server.\n\n**Permissions:**\n- `Manage Server`\n- `Premium Server`",
    "toggle_feature": "Toggles various premium features on or off for the server. Choose the feature you want to enable or disable from the list.\n\n**Permissions:**\n- `Manage Server`\n- `Premium Server`",
    "ban_presets": "Manages preset ban reasons for quick moderation. They will appear on the top of the ban reason list when banning a user with the ban command.\nAllows adding, removing, and listing presets.\n\n**Permissions:**\n- `Manage Server`\n- `Premium Server`",
    "send": "Sends a message to the server who owns the ban for more information. This way you can communicate directly with the server staff regarding the ban without having to join the server."
}