{
    "create": "Allows a user to appeal a ban from a server they are banned from.\nThe user must not be on the bot's global blacklist.\n\n**Permissions:**\n- None required for the user.",
    "report": "Reports a ban to the Banwatch staff for review.\nThis is for bans that may be unjust or harmful.\nThe user must not be on the bot's global blacklist.\n\n**Permissions:**\n- None required for the user.",
    "change": "Changes server-specific settings for Banwatch.\n\n**Permissions:**\n- `Manage Server`",
    "appeals": "Enables or disables the ban appeal system for this server.\n\n**Permissions:**\n- `Manage Server`",
    "visibility": "Toggles whether this server's bans are visible in public lookups.\n\n**Permissions:**\n- `Manage Server`",
    "permissioncheck": "Checks if the bot has the required permissions in the current channel and server. This is the first step in troubleshooting if the bot is not functioning as expected. Please run this command before contacting support.\n\n**Permissions:**\n- None required for the user.",
    "add": "Adds evidence to a user's ban record.\nCan be text, attachments, or both.\n\n**Permissions:**\n- `Moderate Members`",
    "get": "Retrieves and displays all evidence for a given user or ban ID.\n\n**Permissions:**\n- `Moderate Members`",
    "manage": "Displays evidence in a paginated view for management.\nAllows staff to review and handle evidence entries.\n\n**Permissions:**\n- `Moderate Members`",
    "lookup": "Looks up a user's ban history across all monitored servers.\nCan search by user or a specific ban ID.\n\n**Permissions:**\n- `Ban Members`",
    "checkall": "Scans all members in the current server against the global ban database.\nReports users who are found in the database.\n\n**Permissions:**\n- `Ban Members`",
    "remove_deleted": "Scans the server's ban list and removes entries for deleted user accounts, and kicks any deleted accounts still present in the server! This will help you clean up IP bans and ensure your server is free of inactive or deleted users.\n\nWhy would you want to remove IP bans for deleted users? In many cases the IP has been reassigned to a new person because most ISPs recycle IP addresses. Keeping bans for deleted users can inadvertently block new users who are assigned those IPs, potentially causing frustration and loss of legitimate members.\n\n**Permissions:**\n- `Manage Server`\n- `Premium Server`",
    "trapbutton": "Creates a message with a button that instantly bans any user who clicks it.\nUseful for catching malicious bots. Make sure to warn your members not to click it!\n\nThis feature is currently a test; if you have feedback on how to improve its efficacy, please reach out to the support server.\n\n**Permissions:**\n- `Manage Server`\n- `Premium Server`",
    "traprole": "[PREMIUM] Designates a 'trap role'. Any user assigned this role will be instantly banned. This is useful for catching bots that assign themselves roles through onboarding or other automated processes; simply assign the trap role to the bot and it will be banned when the task runs (every hour!).\n\nThis feature is currently a test; if you have feedback on how to improve its efficacy, please reach out to the support server.\n\n**Permissions:**\n- `Manage Server`\n- `Premium Server`",
    "toggle_feature": "Toggles various premium features on or off for the server. Choose the feature you want to enable or disable from the list.\n\n**Permissions:**\n- `Manage Server`\n- `Premium Server`",
    "ban_presets": "Manages preset ban reasons for quick moderation. They will appear on the top of the ban reason list when banning a user with the ban command.\nAllows adding, removing, and listing presets.\n\n**Permissions:**\n- `Manage Server`\n- `Premium Server`",
    "send": "Sends a message to the server who owns the ban for more information. This way you can communicate directly with the server staff regarding the ban without having to join the server.",
    "servers": "Fetches and lists all servers the bot is currently in. This command is for internal staff use to get an overview of the bot's reach.\n\n**Permissions:**\n- Requires BanWatch Staff access.",
    "serverinfo": "Retrieves and displays detailed information about a specific server the bot is in. This includes owner, member counts, and bot-specific data.\n\n**Permissions:**\n- Requires BanWatch Staff access.",
    "userinfo": "Displays detailed information about a specific user across all servers the bot shares with them. Includes ban history and server presence.\n\n**Permissions:**\n- Requires BanWatch Staff access.",
    "verifyban": "Changes the verification status of a ban. Verified bans are considered confirmed and may be treated with higher priority. Proof is required to verify.\n\n**Permissions:**\n- Requires BanWatch Staff access.",
    "banvisibility": "Changes the visibility of a specific ban. Hidden bans will not appear in public logs or commands, making them visible only to staff.\n\n**Permissions:**\n- Requires BanWatch Staff access.",
    "rpseclookup": "Looks up a user's record in the Roleplay Security Bot's database threads. This is a developer tool for cross-referencing security information.\n\n**Permissions:**\n- Requires BanWatch Staff access.",
    "revokeban": "Revokes a ban's log message from all servers. This action does not unban the user but removes the public announcement of the ban.\n\n**Permissions:**\n- Requires BanWatch Staff access.",
    "amistaff": "Checks if you are recognized as a BanWatch staff member. This is a simple way to verify your access level within the bot's permission system.\n\n**Permissions:**\n- None required for the user.",
    "calc_banid": "Calculates the unique ban ID that would be generated for a specific user in a specific guild. This is a utility for debugging and manual lookups.\n\n**Permissions:**\n- Requires BanWatch Staff access.",
    "staff_visibility": "Sets the visibility of a server's bans within the BanWatch network. Hiding a server prevents its bans from being shared or viewed by other servers.\n\n**Permissions:**\n- Requires BanWatch Staff access.",
    "ban": "Bans a specified user from the server. This command offers options for silent bans, message cleaning, and whether to notify the user. A reason for the ban will be requested.\n\n**Permissions:**\n- Requires `Ban Members` permission.",
    "mass_ban": "Bans multiple users from the server simultaneously. This is an efficient tool for handling raids or removing multiple disruptive users at once. A single reason will apply to all.\n\n**Permissions:**\n- Requires `Ban Members` permission.",
    "unban": "Revokes a ban for a specified user, allowing them to rejoin the server. This is essential for correcting banning mistakes or allowing users to return after an appeal.\n\n**Permissions:**\n- Requires `Ban Members` permission.",
    "mass_unban": "Revokes bans for multiple users simultaneously. This is useful for processing multiple successful appeals at once or reversing a mass ban action.\n\n**Permissions:**\n- Requires `Ban Members` permission.",
    "reban": "Updates a user's ban reason by unbanning and immediately re-banning them with a new reason. This is useful for correcting or updating ban records without requiring the user to be present.\n\n**Permissions:**\n- Requires `Ban Members` permission.",
    "kick": "Removes a user from the server. Unlike a ban, a kicked user can rejoin immediately if they have a valid invite. This is a less severe moderation action.\n\n**Permissions:**\n- Requires `Kick Members` permission.",
    "export_bans": "Fetches the entire ban list for the server and compiles it into a text file. This is extremely useful for auditing, backup, or migrating bans to another server or bot.\n\n**Permissions:**\n- Requires `Ban Members` permission.",
    "search_bans": "Searches the server's ban database for entries containing a specific word or phrase in the reason. This helps moderators find patterns or locate specific cases quickly.\n\n**Permissions:**\n- Requires `Ban Members` permission.",
    "copy_bans": "Copies all bans from a specified source server to the current server. This is designed for server owners to synchronize ban lists between servers they manage.\n\n**Permissions:**\n- Requires `Ban Members` permission.\n- User must be the owner of both servers.",
    "support": "Provides a link to the official documentation and support server. Use this if you need help with the bot or want to report an issue.\n\n**Permissions:**\n- None required for the user.",
    "donate": "Provides a link to financially support the development and hosting of BanWatch. Donations help keep the bot running and support future updates.\n\n**Permissions:**\n- None required for the user."
}